{
  "episode": {
    "title": "#9 - Vivek Menon",
    "pubDate": "Sat, 24 May 2025 07:19:41 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/6831730d74a3e4f272cc9b26/size/80123034/video-files/64e42c6ecdda658e5c2ee2c9/607953ef-6587-4190-976f-2aa70f804997.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/5Rq20DQRwVPc2GdPSI5Lho?si=e39480b6bbc24ba0",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000709673729",
    "episodeArt": "public/images/9-vivek.jpeg"
  },
  "synopsis": "In episode #9, hosts Devam and Ahir welcome Vivek Menon, a talented filmmaker and solutions consultant, to discuss his journey in filmmaking, the challenges of balancing creative passions with a corporate career, and the importance of storytelling. The conversation flows from personal anecdotes to the intricacies of writing and directing, all while maintaining a light-hearted and relatable vibe.",
  "quotes": [
    "You can never truly be passionate about something until you engage with it and develop that passion through practice.",
    "If you spend so much time making something, you can't even watch it with people who are supporting you—that's ridiculous.",
    "The best way of learning is by doing it and putting yourself out there.",
    "It's very easy to get in your head about these things sometimes; you really just have to trust that if you find this process interesting, other people will too.",
    "Why can't I just call myself a filmmaker? I am one.",
    "You should not be afraid to put your stuff out there and watch it.",
    "If you can prove to people that you're creating something valuable, they'll see you for who you are.",
    "At the end of the day, you will definitely learn something about yourself, even if it's that you don't want to do this ever again.",
    "You should always be looking back and being mindful of what your journey is because you can only see your growth if you start somewhere.",
    "Make that podcast, make that song—regardless of whether or not that ends up being your passion, you will learn something."
  ],
  "generatedAt": "2026-01-30T18:02:42.621Z",
  "selectedQuoteIndex": 0
}