{
  "episode": {
    "title": "#12 - Valante",
    "pubDate": "Mon, 06 Oct 2025 01:22:17 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/68e319c9d2b59cc467133727/size/65931326/video-files/64e42c6ecdda658e5c2ee2c9/a00658aa-beca-4785-997a-15e1af1ab322.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6AGQd1C66uyUethbuzbwYf?si=d344d953d4e749cf",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000730325929",
    "episodeArt": "public/images/12-valante.jpeg"
  },
  "synopsis": "In episode #12 of PBR, hosts Devam and Ahir welcome the talented musician Valante, who shares his inspiring journey from a childhood in a commune to creating calming and beautiful music. The conversation delves into themes of creativity, the importance of embracing spontaneity, and the challenges of navigating life's uncertainties, all while fostering a sense of connection and understanding among listeners.",
  "quotes": [
    "Life needs to happen for a while in order for me to have something to express.",
    "You can always find a reason to self up about your own privilege.",
    "I think if you open that box, it's hard to close it again because where does that end?",
    "It's normal to not always be on the same page or miscommunications can happen.",
    "Just because you're not giving up all of your possessions doesn't mean you're not helping and being kind.",
    "I could just lay on the bed and be like, why doesn't everybody just lay on the bed? This is the greatest thing ever.",
    "The outcomes are just so... for a lot of other tasks, the outcome is very tangible and immediate.",
    "I think a lot about my students that I teach and I try to give them a sense of peace if I can.",
    "You could just honestly lay out on your balcony and just exist.",
    "Take the opportunity and tell the people close to you that you love them. Don't wait."
  ],
  "generatedAt": "2026-01-30T05:28:00.537Z",
  "selectedQuoteIndex": 0
}