{
  "episode": {
    "title": "#7 - Self Judgement and Pain",
    "pubDate": "Fri, 21 Mar 2025 05:50:39 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/67dcfe2f313f5f04d555dd45/size/142032650/video-files/64e42c6ecdda658e5c2ee2c9/1eccd112-48b5-4a6f-bec2-07858c197c28.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/5DMAJiP8XaH5LEZdYiPthk?si=253499722f844d59",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000700228793",
    "episodeArt": "public/images/7-self-judgement-pain.jpeg"
  },
  "synopsis": "In episode #7 of 'Pineapple Plant Rotation,' Devam and Ahir delve into the themes of self-judgment and personal pain, exploring how these experiences shape our identities and relationships. They discuss the importance of accepting one's vulnerabilities, the complexities of emotional healing, and the journey towards self-acceptance, all while maintaining a light-hearted and relatable tone.",
  "quotes": [
    "You are loved solely where you may show weakness without provoking the strength.",
    "I always wait too long to do every single thing.",
    "Life can only be lived forwards but can only be understood backwards.",
    "You can't control how people see you; you need to trust the people who are right for you to accept you as you are.",
    "Sometimes I'll just cry for hours, and afterwards, I try not to respond by saying I need to be stronger.",
    "Accepting your pain is a powerful step towards healing; it’s not a weakness but a part of being human.",
    "We create these abstractions on top of reality, which can cloud our true perceptions.",
    "You can't please everyone; you need to focus on your own enjoyment and satisfaction.",
    "The instinctive reaction to pain is often to judge ourselves, but we need to acknowledge our feelings without guilt.",
    "It's okay to not be okay; sometimes just existing and breathing is enough."
  ],
  "generatedAt": "2026-01-31T07:16:39.024Z",
  "selectedQuoteIndex": 0
}