{
  "episode": {
    "title": "#9 - Vivek Menon",
    "pubDate": "Sat, 24 May 2025 07:19:41 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/6831730d74a3e4f272cc9b26/size/80123034/video-files/64e42c6ecdda658e5c2ee2c9/607953ef-6587-4190-976f-2aa70f804997.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/5Rq20DQRwVPc2GdPSI5Lho?si=e39480b6bbc24ba0",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000709673729",
    "episodeArt": "public/images/9-vivek.jpeg"
  },
  "synopsis": "In episode #9, hosts Devam and Ahir welcome Vivek Menon, a passionate filmmaker and solutions consultant, as they dive into the creative process behind his web series 'New Normal.' The conversation flows seamlessly from personal anecdotes to the challenges of filmmaking, all while highlighting the importance of self-expression and the joy of creating art.",
  "quotes": [
    "You can never truly be passionate about something until you engage with it and develop that passion through practice.",
    "If you spend so much time and effort making something, you can't even watch it with people who are supporting you—that's ridiculous.",
    "Your experience and your voice are the most unique things you can write.",
    "It's not about the amount of views; it's about the connection you create with your audience.",
    "The best way of learning is by doing it and putting yourself out there.",
    "You should call yourself what you are doing; if you're making a podcast, you're a podcaster.",
    "If there's something that has been on the back of your mind, there's a reason you feel driven to do that thing.",
    "The script is never done; it's all about being open to change.",
    "Realism in storytelling often comes from our own experiences and how we perceive the world.",
    "Don't be afraid to put your stuff out there; the work will talk for itself."
  ],
  "generatedAt": "2026-01-29T21:00:39.518Z",
  "selectedQuoteIndex": 0
}