{
  "episode": {
    "title": "Anxiety",
    "pubDate": "Sun, 01 Oct 2023 23:50:03 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/651a05abbbe6dfae48efdb1c/size/134558935/video-files/64e42c6ecdda658e5c2ee2c9/c98ac4a3-0adc-4b47-a06d-874112d18693.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/2v4OCvGbCZ9rw8U4zSOxTw?si=f64ad3d825b7441a",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000629839562",
    "episodeArt": "public/images/2-anxiety.jpeg"
  },
  "synopsis": "In this insightful episode of Pineapple Blunt Rotation, hosts Devam and Ahir dive deep into the complexities of anxiety, exploring their personal experiences and the impacts it has on their daily lives. Through candid discussions, they highlight the importance of self-compassion and the journey towards understanding and managing anxiety, ultimately fostering a sense of community and support among listeners.",
  "quotes": [
    "The hardest part is accepting that anxiety is something you will have to deal with for the rest of your life, but it doesn't mean you can't improve.",
    "It's almost like anxiety is a fog, and that part of you that knows what's actually going on is underneath that fog.",
    "You can’t control everything, but you can choose how you respond to it.",
    "Every day gets a little easier, but you got to do it every day—that's the hard part.",
    "The anxiety is just a part of the journey, not the destination.",
    "We all need to embrace our sadness and cherish it, not push it away.",
    "It's so much easier to tell yourself that you can’t do something than to actually try and do it.",
    "Sometimes, the best way to deal with anxiety is to just talk to yourself like you would to a friend.",
    "If you don’t express yourself, you’ll never have to worry about anyone judging you—but you’ll also never be truly happy.",
    "Life is a continuous stream of experiences, and we need to accept the good with the bad."
  ],
  "generatedAt": "2026-01-31T02:42:32.587Z",
  "selectedQuoteIndex": 0
}