{
  "episode": {
    "title": "#10 - Rishabh Meswani",
    "pubDate": "Sun, 08 Jun 2025 06:36:09 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/68452f59f3cfa2a429d03f9d/size/162615761/video-files/64e42c6ecdda658e5c2ee2c9/967c027c-3783-4135-ae72-0149190bdb9a.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/4CxjLtpufZdsL9xUh7rHNQ?si=c5dc4301fdf94feb",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000711975380",
    "episodeArt": "public/images/10-rishabh.jpeg"
  },
  "synopsis": "In episode #10, hosts Devam and Ahir welcome Rishabh Meswani, founder of the Fremont Debate Academy, for an engaging conversation about the impact of debate on youth development. They dive into the challenges of leadership, the importance of communication, and the balancing act of personal passions and responsibilities, all while sharing humorous anecdotes and insights about navigating life and relationships.",
  "quotes": [
    "The worst case scenario is never as bad as you think it is; prepare for it, and you'll find peace.",
    "Everyone should feel like they're getting something out of their involvement, not just doing it for college apps.",
    "It's amazing how a small recognition can make someone feel valued and motivated.",
    "You have to give yourself the chance to explore; you never know what you might enjoy.",
    "Sometimes, the best way to deal with anxiety is to map out the worst case and be at peace with it.",
    "We all have to be okay with the trade-offs in life; it's how we find balance.",
    "When you put in effort, you should also expect to reap the rewards, but don’t forget to enjoy the journey.",
    "If you find yourself in a gray state, take a step back and reflect on what you truly want.",
    "The youth today have a unique perspective, and we must adapt to their changing communication styles.",
    "It's okay to not be perfect; what's important is that you give your best effort and learn from the experience."
  ],
  "generatedAt": "2026-01-30T06:08:33.746Z",
  "selectedQuoteIndex": 0
}