{
  "episode": {
    "title": "#9 - Vivek Menon",
    "pubDate": "Sat, 24 May 2025 07:19:41 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/6831730d74a3e4f272cc9b26/size/80123034/video-files/64e42c6ecdda658e5c2ee2c9/607953ef-6587-4190-976f-2aa70f804997.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/5Rq20DQRwVPc2GdPSI5Lho?si=e39480b6bbc24ba0",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000709673729",
    "episodeArt": "public/images/9-vivek.jpeg"
  },
  "synopsis": "In episode #9, Devam and Ahir welcome Vivek Menon, a talented filmmaker and solutions consultant, who shares his journey of creating the web series 'New Normal' alongside his father. The conversation dives into the challenges and joys of filmmaking, the importance of storytelling, and the significance of embracing one's identity as a creator.",
  "quotes": [
    "You can't really open up and talk about my feelings unless I'm on a podcast.",
    "If you spend so much time making something, you can't even watch it with people who are supporting you—that's so ridiculous.",
    "The best film school is just doing, making stuff.",
    "You should always be looking back and being mindful of what your journey is because you can see your growth.",
    "Success is not just about being a famous filmmaker; it's about continuously telling the stories you want to tell.",
    "Just because you're not doing something full-time doesn't mean you can't call yourself what you are.",
    "The idea of success is subjective; it can be about making the projects you love, regardless of the scale.",
    "If there's something that has been on the back of your mind, throw yourself into it and see if you can get something valuable out of it.",
    "It's okay to have creative conflicts; it shows you're passionate about your art.",
    "Even if you think your content is cringy, putting yourself out there is a huge step."
  ],
  "generatedAt": "2026-01-29T04:21:13.041Z",
  "selectedQuoteIndex": 0
}