{
  "episode": {
    "title": "#11 - SOLOOOO",
    "pubDate": "Thu, 10 Jul 2025 06:03:48 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/686f57c450a19d9aafee986d/size/102313389/video-files/64e42c6ecdda658e5c2ee2c9/7b48f17a-cbd6-4f5f-8e25-eac3fbda921e.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6APuvuawkoWbyKYBCfyCif?si=cc23f1a1d36249f4",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000716618731",
    "episodeArt": "public/images/11-solooo-1.jpeg"
  },
  "synopsis": "In episode #11 titled 'SOLOOOO', Ahir shares an introspective and humorous account of his recent knee injury and the chaotic healthcare journey that followed. He reflects on themes of self-discovery, emotional resilience, and the importance of meaningful connections, all while engaging with listener questions that spark deeper conversations about life and love.",
  "quotes": [
    "The way you live your life every day is how you end up living your life.",
    "Loneliness and melancholy are beautiful feelings; sometimes they just point to some need of yours that isn't being met.",
    "Are you able to feel joy by yourself? Can you go out and have a meal alone and enjoy that meal?",
    "The problem is rooted in the fact that maybe you don't have a strong enough bearing on the ground.",
    "You have to live life because it's worth living.",
    "Love without expectation; it's the only way to keep your heart open.",
    "Cooking isn't that hard; ingredients are just Legos—you just need to figure out what goes together.",
    "It's easy to blame other people and it's easy to blame yourself, but I've realized that both of these are about controlling the narrative.",
    "You have to give yourself small acts of happiness; maybe ice cream on Fridays, or a couple of cocoa in the morning.",
    "What does your life look like if it's just you? Are you able to be okay by yourself?"
  ],
  "generatedAt": "2026-01-29T07:52:18.217Z",
  "selectedQuoteIndex": 0
}