{
  "episode": {
    "title": "#10 - Rishabh Meswani",
    "pubDate": "Sun, 08 Jun 2025 06:36:09 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/68452f59f3cfa2a429d03f9d/size/162615761/video-files/64e42c6ecdda658e5c2ee2c9/967c027c-3783-4135-ae72-0149190bdb9a.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/4CxjLtpufZdsL9xUh7rHNQ?si=c5dc4301fdf94feb",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000711975380",
    "episodeArt": "public/images/10-rishabh.jpeg"
  },
  "synopsis": "In episode #10 featuring Rishabh Meswani, the hosts Devam and Ahir engage in a dynamic conversation about the impact of debate and civic engagement on youth. Rishabh shares his journey of founding the Fremont Debate Academy, emphasizing the importance of communication, personal growth, and the challenges of balancing passion with responsibility.",
  "quotes": [
    "The whole idea is that everyone in FDA should feel like they're getting something out of it.",
    "It's really important to set expectations and communicate with the people you're working with.",
    "Sometimes the best way to deal with anxiety is to map out the worst-case scenario and be at peace with it.",
    "You have to put yourself in a slightly uncomfortable situation and actually doing that sometimes might make you like that activity more.",
    "If you're not sure what you want to do in life, try things out.",
    "You can't always make excuses for other people; a part of you dies every time.",
    "It's important to find something you're passionate about that you enjoy doing.",
    "The worst case can happen, but I know that I'm not going to die or my life's not going to end.",
    "It's not a one-size-fits-all kind of deal; not everyone has to become a leader in debate.",
    "You have to be okay with the trade-off that sometimes if work is really stressful, FDA is going to have to take the backseat."
  ],
  "generatedAt": "2026-01-29T02:45:42.069Z",
  "selectedQuoteIndex": 0
}