{
  "episode": {
    "title": "#10 - Rishabh Meswani",
    "pubDate": "Sun, 08 Jun 2025 06:36:09 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/68452f59f3cfa2a429d03f9d/size/162615761/video-files/64e42c6ecdda658e5c2ee2c9/967c027c-3783-4135-ae72-0149190bdb9a.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/4CxjLtpufZdsL9xUh7rHNQ?si=c5dc4301fdf94feb",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000711975380",
    "episodeArt": "public/images/10-rishabh.jpeg"
  },
  "synopsis": "In episode #10 of the podcast, hosts Devam and Ahir engage in a lively conversation with guest Rishabh Meswani, founder of the Fremont Debate Academy. They explore the challenges of running a nonprofit organization, the importance of communication and culture, and the personal growth that comes from balancing multiple passions and responsibilities.",
  "quotes": [
    "The worst case scenario is never as bad as you imagine it to be.",
    "If you're not sure what you want to do in life, try things out; give yourself a chance to explore.",
    "Everyone should feel like they're getting something out of their involvement; it shouldn't just be for college apps.",
    "Sometimes the best way to deal with anxiety is to map out the worst case scenario and accept it.",
    "You have to be okay with the fact that if work is really stressful, something else in your life might have to take the backseat.",
    "It's important to find something you're passionate about that you enjoy doing.",
    "In a nonprofit, you want to make sure people feel like they belong; that their ideas are being heard.",
    "To build a strong culture, recognize even the smallest wins; it makes a big difference.",
    "Balancing multiple passions can lead to unexpected happiness in other areas of your life.",
    "Communication is key; personal conversations can help build understanding and improve team dynamics."
  ],
  "generatedAt": "2026-02-02T02:36:23.321Z",
  "selectedQuoteIndex": 0
}