{
  "episode": {
    "title": "#11 - SOLOOOO",
    "pubDate": "Thu, 10 Jul 2025 06:03:48 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/686f57c450a19d9aafee986d/size/102313389/video-files/64e42c6ecdda658e5c2ee2c9/7b48f17a-cbd6-4f5f-8e25-eac3fbda921e.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6APuvuawkoWbyKYBCfyCif?si=cc23f1a1d36249f4",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000716618731",
    "episodeArt": "public/images/11-solooo-1.jpeg"
  },
  "synopsis": "In episode #11 titled 'SOLOOOO', Ahir shares a personal journey of recovery after dislocating his kneecap, weaving in reflections on life, relationships, and the importance of emotional intelligence. His candid storytelling, peppered with humor and insight, resonates with listeners, encouraging them to embrace their own experiences and connections.",
  "quotes": [
    "The way you live your life every day is how you end up living your life.",
    "What happens when someone who does have those kinds of responsibilities and doesn't have a super flexible job? That's a really hard thing to do.",
    "You have to give yourself small acts of happiness; a cup of cocoa in the morning can help you start your day.",
    "Open your arms if you want to be held.",
    "Cooking isn't that hard; ingredients are just Legos. You just need to figure out what types of things go together.",
    "Love without expectation; it's about being open to all that life has to offer.",
    "Loneliness and melancholy are beautiful feelings; sometimes they just point to a need of yours that isn't being met.",
    "If you're scared about how to cook, take a potato, dice it, take some oil, and use one spice.",
    "Every relationship ends, but the ability to love and be loved does not.",
    "You have to learn to see and feel all that is when you start feeling a little bit less lonely."
  ],
  "generatedAt": "2026-01-31T11:17:49.401Z",
  "selectedQuoteIndex": 0
}