{
  "episode": {
    "title": "#6 - Self Worth / Neuroticism",
    "pubDate": "Fri, 30 Aug 2024 15:11:17 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/66d1e1155a209d7b99c96ca1/size/153433437/video-files/64e42c6ecdda658e5c2ee2c9/cdbf5e9e-6d6a-4864-9776-fe6e999a3ab1.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/0zUf4c2qGkIbVP7CxEIQSO?si=e1ee267754224215",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000667449172",
    "episodeArt": "public/images/6-self-worth-neuroticism.jpeg"
  },
  "synopsis": "In episode #6 of Pineapple Blood Rotation, hosts Devam and Ahir engage in a deep and candid discussion about self-worth and neuroticism, exploring personal experiences and emotional growth. Their honest reflections reveal the complexities of navigating mental health, relationships, and the journey towards self-acceptance, all while maintaining a light-hearted and relatable tone.",
  "quotes": [
    "It's so much better to finally get a grasp on this stuff after years of feeling like having these feelings and not being able to understand where they were coming from.",
    "You can't rush something like that; all that's gonna do is make it harder to get to where you want to be emotionally.",
    "I realized that the reason why things like that would make me so anxious was because I didn't truly believe that my worth had value.",
    "The problems and issues that I feel like I can't acknowledge scare me more than the ones that I'm dealing with.",
    "You have to trust the people around you too; nobody has ill intentions.",
    "I think the most valuable things in life are the things that defy your expectations.",
    "You have to realize that the way you're living is an option, and you don't really see that until you talk to people from other backgrounds.",
    "We need to give ourselves time to mature and understand how we're feeling.",
    "No one hurts people in isolation; there's a whole story behind every action.",
    "If you don't love yourself, you can't ever love other people; it all bleeds out in your relationships."
  ],
  "generatedAt": "2026-01-30T23:18:37.331Z",
  "selectedQuoteIndex": 0
}