{
  "episode": {
    "title": "#11 - SOLOOOO",
    "pubDate": "Thu, 10 Jul 2025 06:03:48 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/686f57c450a19d9aafee986d/size/102313389/video-files/64e42c6ecdda658e5c2ee2c9/7b48f17a-cbd6-4f5f-8e25-eac3fbda921e.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6APuvuawkoWbyKYBCfyCif?si=cc23f1a1d36249f4",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000716618731",
    "episodeArt": "public/images/11-solooo-1.jpeg"
  },
  "synopsis": "In episode #11 titled 'SOLOOOO', Devam shares a candid and humorous account of his recent knee injury and the chaotic journey through the healthcare system. He reflects on personal growth, loneliness, and the importance of meaningful connections while also addressing listener questions with heartfelt insights and relatable anecdotes.",
  "quotes": [
    "The way you live your life every day is how you end up living your life.",
    "Sometimes you get, you try to initiate friendships because you think you might gel well with someone, and maybe nothing comes out of it, you know, it happens sometimes. Just don't take it personally.",
    "What happens when someone who does have those kinds of responsibilities and doesn't have like a super flexible job? That's a really hard thing to do.",
    "You have to give yourself small acts of happiness.",
    "Are you able to feel joy by yourself? Do you have fun in your own company?",
    "It's easy to blame other people and it's easy to blame yourself. But I've realized that both of these are about controlling the narrative.",
    "Open your arms if you want to be held.",
    "I think people need to be more open to things. Just shut up and listen sometimes.",
    "Love is a choice, but you have to pick loving yourself over loving someone else for the really basic things.",
    "Loneliness and melancholy are beautiful feelings. Sometimes it just points to some need of yours that isn't being met."
  ],
  "generatedAt": "2026-01-29T17:20:46.638Z",
  "selectedQuoteIndex": 0
}