{
  "episode": {
    "title": "#11 - SOLOOOO",
    "pubDate": "Thu, 10 Jul 2025 06:03:48 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/686f57c450a19d9aafee986d/size/102313389/video-files/64e42c6ecdda658e5c2ee2c9/7b48f17a-cbd6-4f5f-8e25-eac3fbda921e.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6APuvuawkoWbyKYBCfyCif?si=cc23f1a1d36249f4",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000716618731",
    "episodeArt": "public/images/11-solooo-1.jpeg"
  },
  "synopsis": "In episode #11 titled 'SOLOOOO', host Ahir shares a candid and humorous account of his recent knee injury and the chaotic journey through the healthcare system, reflecting on personal growth, the importance of self-acceptance, and the complexities of loneliness. He engages with listener questions, offering insights on love, emotional intelligence, and the beauty of living authentically.",
  "quotes": [
    "The way you live your life every day is how you end up living your life.",
    "It's crazy how the system can take you for a ride if you don’t know the right things and push the right people.",
    "Are you able to feel joy by yourself? Can you go out and have a meal alone and enjoy that meal?",
    "Loneliness and melancholy are beautiful feelings; sometimes they point to some need of yours that isn't being met.",
    "You have to give yourself small acts of happiness; maybe a couple of cocoa in the morning or ice cream on Fridays.",
    "Love without expectation is the greatest freedom you can give yourself.",
    "Relationships end, but the ability to love and be loved does not.",
    "Cooking isn't that hard; ingredients are just colors, and you need to figure out what types of things go together.",
    "People have too many opinions and rules; sometimes you just need to shut up and listen.",
    "Open your arms if you want to be held; what's the worst that could happen?"
  ],
  "generatedAt": "2026-01-28T15:30:40.595Z",
  "selectedQuoteIndex": 0
}