{
  "episode": {
    "title": "#11 - SOLOOOO",
    "pubDate": "Thu, 10 Jul 2025 06:03:48 GMT",
    "audioUrl": "https://redirect.zencastr.com/r/episode/686f57c450a19d9aafee986d/size/102313389/video-files/64e42c6ecdda658e5c2ee2c9/7b48f17a-cbd6-4f5f-8e25-eac3fbda921e.mp4",
    "spotifyUrl": "https://open.spotify.com/episode/6APuvuawkoWbyKYBCfyCif?si=cc23f1a1d36249f4",
    "applePodcastsUrl": "https://podcasts.apple.com/us/podcast/pineapple-blunt-rotation/id1703706417?i=1000716618731",
    "episodeArt": "public/images/11-solooo-1.jpeg"
  },
  "synopsis": "In episode #11 titled 'SOLOOOO', Devam shares a candid and humorous account of his recent knee injury, navigating the healthcare system, and the lessons learned during his recovery. He reflects on personal growth, the importance of connection, and the challenges of being single, all while engaging with listener questions that spark deep insights and relatable anecdotes.",
  "quotes": [
    "The way you live your life every day is how you end up living your life.",
    "What happens when someone who does have those kinds of responsibilities and doesn't have a super flexible job? That's a really hard thing to do.",
    "It's a plot point in the grand scheme of things and it adds to the lore in a way.",
    "You have to give yourself small acts of happiness; a couple of cocoa in the morning if that helps you start your day.",
    "Are you able to feel joy by yourself? Do you have fun in your own company?",
    "Loneliness and melancholy are beautiful feelings; sometimes they just point to some need of yours that isn't being met.",
    "It's easy to blame other people and it's easy to blame yourself, but both are about controlling the narrative.",
    "I think people need to be more open to things. Just shut up and listen sometimes.",
    "Cooking isn't that hard; ingredients are just legos. You just need to figure out what types of things go together.",
    "Are you okay with loving without expectation? Are you able to love knowing that grief is the natural compliment to it?"
  ],
  "generatedAt": "2026-01-30T10:36:52.894Z",
  "selectedQuoteIndex": 0
}